package com.NaumDeveloper.JavaRush;// 4.17 Вывести на экран числа от 1 до 10 используя цикл while.

/*

Вывести на экран числа от 1 до 10 используя цикл while.
Каждое значение с новой строки.

 */

import java.io.*;

public class Main {


    public static void main(String[] args) throws Exception {

        int a = 0;

        while (a<10) {
            a++;
            System.out.println(a);

        }

        }
    }

