package com.NaumDeveloper.JavaRush;// 3.22   оператор сравнения If Метод должен выводить на экран ближайшее из двух чисел

/*

Напишите метод displayClosestToTen.
Метод должен выводить на экран ближайшее к 10 из двух чисел, записанных в аргументах метода.
Например, среди чисел 8 и 11 ближайшее к десяти 11.
Если оба числа на равной длине к 10, то вывести на экран любое из них.

Подсказка:
используйте метод public static int abs(int a), который возвращает абсолютную величину числа.

 */

public class Main {

    public static void main(String[] args) {
        closeToTen(8, 11);
        closeToTen(7, 14);
    }

    public static void closeToTen(int a, int b) {

        if (abs(10-a)<abs(10-b))
            System.out.println(a);

        else
            System.out.println(b);

    }

    public static int abs(int a) {
        if (a < 0) {
            return -a;
        } else {
            return a;
        }
    }
}

